// x节课
// 每节课只能三个人
// 随机抽两个都至少在一起上过课
// 这个班最多有多少人

// 两节课
// 1, 2, 3
// 1, 2, 3

// 三节课
// 1, 2, 3
// 4, 1, 2
// 4, 3, x

// 四节课
// 1, 2, 3
// 4, 1, 2
// 4, 3, x:5
// 5, 1, 2

// 五-七节课
// 1, 2, 3
// 4, 1, 2
// 4, 3, x:5
// 5, 1, 2
// 6, 1, 2
// 6, 3, 4
// 6, 5, y

//
// 1, 2, 3
// 4, 1, 2
// 4, 3, x:5
// 5, 1, 2
// 6, 1, 2
// 6, 3, 4
// 6, 5, y:7
// 7, 1, 2
// 7, 3, 4

//
// 1, 2, 3
// 4, 1, 2
// 4, 3, x:5
// 5, 1, 2
// 6, 1, 2
// 6, 3, 4
// 6, 5, y:7
// 7, 1, 2
// 7, 3, 4
// 8, 1, 2
// 8, 3, 4
// 8, 5, 6
// 8, 7, z

//
// 1, 2, 3
// 4, 1, 2
// 4, 3, x:5
// 5, 1, 2
// 6, 1, 2
// 6, 3, 4
// 6, 5, y:7
// 7, 1, 2
// 7, 3, 4
// 8, 1, 2
// 8, 3, 4
// 8, 5, 6
// 8, 7, z:9
// 9, 1, 2
// 9, 3, 4
// 9, 5, 6

// 第n个人进来的时候课程的数量
function getLessonCount(n) {
  function getRowCount(m) {
    const rest = m - 1;
    return m % 2 === 0 ? Math.ceil(rest / 2) : rest / 2 - 1;
  }

  let totalRowCount = 1;
  for (let i = 4; i <= n; i++) {
    totalRowCount += getRowCount(i);
  }

  return totalRowCount;
}

console.log(getLessonCount(8)); // 13
console.log(getLessonCount(9)); // 16

// x: 15
